---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailSupportPlacementFailure
source: html/20d48544-afe6-8593-ba17-4abed8a5ddb1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailSupportPlacementFailure Property

Cannot place the supports along the rail path.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContinuousRailSupportPlacementFailure { get; }
```